Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.GenerateReportConfigFile(Autodesk.Revit.DB.Document,System.String)
Generates the report configuration json file based on the document unit and locale.
doc:
The document where the configuration is based upon.
outputFileName:
The output json file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.GetReportContent
Gets the report content in this view.
Remarks:
The report shows "Calculating..." if the background calculation is still going on.
You may call isAnalysisCompleted() to check if the calculation is completed.
Returns:
The content of the report as displayed in the view, or the referenced file name.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.IsAnalysisCompleted
Indicates if the background systems analysis has completed or not.
Returns:
True if completed, otherwise false.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.GetLatestSystemsAnalysisReport(Autodesk.Revit.DB.Document)
Gets the latest report of systems analysis.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.CancelSystemsAnalysis(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Cancels the systems analysis based on the report element id.
document:
The document where the report element existed.
reportElement:
The report element that identifies the analysis.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.RequestSystemsAnalysis(Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions)
Requests a new systems analysis in the background.
options:
The additional options to run systems analysis. If empty, use the default value in the view element.
The request may download the weather file at current site location if not specified in the options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
No weather station is within 500 nautical miles of this site location.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Fail to download the weather file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A valid energy model is required for systems analysis.
-or-
Unable to access the weather service. Try again later.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new view for the systems analysis report.
Remarks:
A report instance is typically created to request a new systems analysis. The default values include the weather file "USA_CO_Denver.Intl.AP.725650_TMY3.epw" and
the workflow file "HVAC Systems Loads and Sizing.osw". Both are part of the Revit installation. The default output folder is the system TEMP folder.
document:
The document where the view is to be created.
viewName:
The name of the new report view.
Returns:
The newly created view instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
viewName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.AnalysisDateAndTime
Identifies the analysis date and time when it was requested.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.ReportStyle
The report style that specifies the display content.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder
The full path of the output folder for systems analysis
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.WeatherFile
The full path name of the weather file used for the systems analysis.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisWorkflowFile
The full path name of the original system analysis workflow file.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
Represents a report instance of the systems analysis.
Since:
2020.1